running_app/app/controllers/blog_posts_controller.rb

INSERT INTO "blog_posts" ("title", "author", "date", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "2k Running Plan"], ["author", "ehau"], ["date", "10/28/2019"], ["content", "Greetings"], ["created_at", "2019-10-27 20:36:07.312395"], ["updated_at", "2019-10-27 20:36:07.312395"]]
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save

UPDATE "blog_posts" SET "content" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3
---
  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 3]]
---
  def destroy
    @blog_post.destroy