running_app/app/controllers/search_actives_controller.rb

  def index
    @search_actives = SearchActive.all
---
SELECT "search_actives".* FROM "search_actives"

  def create
    @search_active = SearchActive.new(search_active_params)

    respond_to do |format|
      if @search_active.save
---
INSERT INTO "search_actives" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-10-28 00:19:11.236030"], ["updated_at", "2019-10-28 00:19:11.236030"]]

  def destroy
    @search_active.destroy
---
DELETE FROM "search_actives" WHERE "search_actives"."id" = $1  [["id", 2]]

    def set_search_active
      @search_active = SearchActive.find(params[:id])
---
SELECT "search_actives".* FROM "search_actives" WHERE "search_actives"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]